While making curved beam type "[Type Name]" Shared Family Instances were not created
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NotBentSharedFamily { get; }
  Visual Basic
Public Shared ReadOnly Property NotBentSharedFamily As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NotBentSharedFamily {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures BendFailures Class
  Autodesk.Revit.DB Namespace